HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxSent_reg.h
/** \brief 5B0, Interrupt Node Pointer Register 18 */
#define SENT_CH18_INP /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INP*)0xF00035B0u)
/** Alias (User Manual Name) for SENT_CH18_INP.
* To use register names with standard convension, please use SENT_CH18_INP.
*/
#define SENT_INP18 (SENT_CH18_INP)

/** \brief 5B4, Watch Dog Timer Register 18 */
#define SENT_CH18_WDT /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_WDT*)0xF00035B4u)
/** Alias (User Manual Name) for SENT_CH18_WDT.
* To use register names with standard convension, please use SENT_CH18_WDT.
*/
#define SENT_WDT18 (SENT_CH18_WDT)

/** \brief 5C0, Channel Pre Divider Register 19 */
#define SENT_CH19_CPDR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_CPDR*)0xF00035C0u)
/** Alias (User Manual Name) for SENT_CH19_CPDR.
* To use register names with standard convension, please use SENT_CH19_CPDR.
*/
#define SENT_CPDR19 (SENT_CH19_CPDR)

/** \brief 5C4, Channel Fractional Divider Register 19 */
#define SENT_CH19_CFDR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_CFDR*)0xF00035C4u)
/** Alias (User Manual Name) for SENT_CH19_CFDR.
* To use register names with standard convension, please use SENT_CH19_CFDR.
*/
#define SENT_CFDR19 (SENT_CH19_CFDR)

/** \brief 5C8, Receiver Control Register 19 */
#define SENT_CH19_RCR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_RCR*)0xF00035C8u)
/** Alias (User Manual Name) for SENT_CH19_RCR.
* To use register names with standard convension, please use SENT_CH19_RCR.
*/
#define SENT_RCR19 (SENT_CH19_RCR)

/** \brief 5CC, Receive Status Register 19 */
#define SENT_CH19_RSR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_RSR*)0xF00035CCu)
/** Alias (User Manual Name) for SENT_CH19_RSR.
* To use register names with standard convension, please use SENT_CH19_RSR.
*/
#define SENT_RSR19 (SENT_CH19_RSR)

/** \brief 5D0, Serial Data and Status Register 19 */
#define SENT_CH19_SDS /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_SDS*)0xF00035D0u)
/** Alias (User Manual Name) for SENT_CH19_SDS.
* To use register names with standard convension, please use SENT_CH19_SDS.
*/
#define SENT_SDS19 (SENT_CH19_SDS)

/** \brief 5D4, Input and Output Control Register 19 */
#define SENT_CH19_IOCR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_IOCR*)0xF00035D4u)
/** Alias (User Manual Name) for SENT_CH19_IOCR.
* To use register names with standard convension, please use SENT_CH19_IOCR.
*/
#define SENT_IOCR19 (SENT_CH19_IOCR)

/** \brief 5D8, SPC Control Register 19 */
#define SENT_CH19_SCR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_SCR*)0xF00035D8u)
/** Alias (User Manual Name) for SENT_CH19_SCR.
* To use register names with standard convension, please use SENT_CH19_SCR.
*/
#define SENT_SCR19 (SENT_CH19_SCR)

/** \brief 5DC, Receive Data View Register 19 */
#define SENT_CH19_VIEW /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_VIEW*)0xF00035DCu)
/** Alias (User Manual Name) for SENT_CH19_VIEW.
* To use register names with standard convension, please use SENT_CH19_VIEW.
*/
#define SENT_VIEW19 (SENT_CH19_VIEW)

/** \brief 5E0, Interrupt Status Register 19 */
#define SENT_CH19_INTSTAT /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INTSTAT*)0xF00035E0u)
/** Alias (User Manual Name) for SENT_CH19_INTSTAT.
* To use register names with standard convension, please use SENT_CH19_INTSTAT.
*/
#define SENT_INTSTAT19 (SENT_CH19_INTSTAT)

/** \brief 5E4, Interrupt Set Register 19 */
#define SENT_CH19_INTSET /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INTSET*)0xF00035E4u)
/** Alias (User Manual Name) for SENT_CH19_INTSET.
* To use register names with standard convension, please use SENT_CH19_INTSET.
*/
#define SENT_INTSET19 (SENT_CH19_INTSET)

/** \brief 5E8, Interrupt Clear Register 19 */
#define SENT_CH19_INTCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INTCLR*)0xF00035E8u)
/** Alias (User Manual Name) for SENT_CH19_INTCLR.
* To use register names with standard convension, please use SENT_CH19_INTCLR.
*/
#define SENT_INTCLR19 (SENT_CH19_INTCLR)

/** \brief 5EC, Interrupt Enable Register 19 */
#define SENT_CH19_INTEN /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INTEN*)0xF00035ECu)
/** Alias (User Manual Name) for SENT_CH19_INTEN.
* To use register names with standard convension, please use SENT_CH19_INTEN.
*/
#define SENT_INTEN19 (SENT_CH19_INTEN)

/** \brief 5F0, Interrupt Node Pointer Register 19 */
#define SENT_CH19_INP /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INP*)0xF00035F0u)
/** Alias (User Manual Name) for SENT_CH19_INP.
* To use register names with standard convension, please use SENT_CH19_INP.
*/
#define SENT_INP19 (SENT_CH19_INP)

/** \brief 5F4, Watch Dog Timer Register 19 */
#define SENT_CH19_WDT /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_WDT*)0xF00035F4u)
/** Alias (User Manual Name) for SENT_CH19_WDT.
* To use register names with standard convension, please use SENT_CH19_WDT.
*/
#define SENT_WDT19 (SENT_CH19_WDT)

/** \brief 600, Channel Pre Divider Register 20 */
#define SENT_CH20_CPDR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_CPDR*)0xF0003600u)
/** Alias (User Manual Name) for SENT_CH20_CPDR.
* To use register names with standard convension, please use SENT_CH20_CPDR.
*/
#define SENT_CPDR20 (SENT_CH20_CPDR)

/** \brief 604, Channel Fractional Divider Register 20 */
#define SENT_CH20_CFDR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_CFDR*)0xF0003604u)
/** Alias (User Manual Name) for SENT_CH20_CFDR.
* To use register names with standard convension, please use SENT_CH20_CFDR.
*/
#define SENT_CFDR20 (SENT_CH20_CFDR)

/** \brief 608, Receiver Control Register 20 */
#define SENT_CH20_RCR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_RCR*)0xF0003608u)
/** Alias (User Manual Name) for SENT_CH20_RCR.
* To use register names with standard convension, please use SENT_CH20_RCR.
*/
#define SENT_RCR20 (SENT_CH20_RCR)

/** \brief 60C, Receive Status Register 20 */
#define SENT_CH20_RSR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_RSR*)0xF000360Cu)
/** Alias (User Manual Name) for SENT_CH20_RSR.
* To use register names with standard convension, please use SENT_CH20_RSR.
*/
#define SENT_RSR20 (SENT_CH20_RSR)

