HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxSent_reg.h
/** \brief 6D0, Serial Data and Status Register 23 */
#define SENT_CH23_SDS /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_SDS*)0xF00036D0u)
/** Alias (User Manual Name) for SENT_CH23_SDS.
* To use register names with standard convension, please use SENT_CH23_SDS.
*/
#define SENT_SDS23 (SENT_CH23_SDS)

/** \brief 6D4, Input and Output Control Register 23 */
#define SENT_CH23_IOCR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_IOCR*)0xF00036D4u)
/** Alias (User Manual Name) for SENT_CH23_IOCR.
* To use register names with standard convension, please use SENT_CH23_IOCR.
*/
#define SENT_IOCR23 (SENT_CH23_IOCR)

/** \brief 6D8, SPC Control Register 23 */
#define SENT_CH23_SCR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_SCR*)0xF00036D8u)
/** Alias (User Manual Name) for SENT_CH23_SCR.
* To use register names with standard convension, please use SENT_CH23_SCR.
*/
#define SENT_SCR23 (SENT_CH23_SCR)

/** \brief 6DC, Receive Data View Register 23 */
#define SENT_CH23_VIEW /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_VIEW*)0xF00036DCu)
/** Alias (User Manual Name) for SENT_CH23_VIEW.
* To use register names with standard convension, please use SENT_CH23_VIEW.
*/
#define SENT_VIEW23 (SENT_CH23_VIEW)

/** \brief 6E0, Interrupt Status Register 23 */
#define SENT_CH23_INTSTAT /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INTSTAT*)0xF00036E0u)
/** Alias (User Manual Name) for SENT_CH23_INTSTAT.
* To use register names with standard convension, please use SENT_CH23_INTSTAT.
*/
#define SENT_INTSTAT23 (SENT_CH23_INTSTAT)

/** \brief 6E4, Interrupt Set Register 23 */
#define SENT_CH23_INTSET /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INTSET*)0xF00036E4u)
/** Alias (User Manual Name) for SENT_CH23_INTSET.
* To use register names with standard convension, please use SENT_CH23_INTSET.
*/
#define SENT_INTSET23 (SENT_CH23_INTSET)

/** \brief 6E8, Interrupt Clear Register 23 */
#define SENT_CH23_INTCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INTCLR*)0xF00036E8u)
/** Alias (User Manual Name) for SENT_CH23_INTCLR.
* To use register names with standard convension, please use SENT_CH23_INTCLR.
*/
#define SENT_INTCLR23 (SENT_CH23_INTCLR)

/** \brief 6EC, Interrupt Enable Register 23 */
#define SENT_CH23_INTEN /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INTEN*)0xF00036ECu)
/** Alias (User Manual Name) for SENT_CH23_INTEN.
* To use register names with standard convension, please use SENT_CH23_INTEN.
*/
#define SENT_INTEN23 (SENT_CH23_INTEN)

/** \brief 6F0, Interrupt Node Pointer Register 23 */
#define SENT_CH23_INP /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INP*)0xF00036F0u)
/** Alias (User Manual Name) for SENT_CH23_INP.
* To use register names with standard convension, please use SENT_CH23_INP.
*/
#define SENT_INP23 (SENT_CH23_INP)

/** \brief 6F4, Watch Dog Timer Register 23 */
#define SENT_CH23_WDT /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_WDT*)0xF00036F4u)
/** Alias (User Manual Name) for SENT_CH23_WDT.
* To use register names with standard convension, please use SENT_CH23_WDT.
*/
#define SENT_WDT23 (SENT_CH23_WDT)

/** \brief 700, Channel Pre Divider Register 24 */
#define SENT_CH24_CPDR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_CPDR*)0xF0003700u)
/** Alias (User Manual Name) for SENT_CH24_CPDR.
* To use register names with standard convension, please use SENT_CH24_CPDR.
*/
#define SENT_CPDR24 (SENT_CH24_CPDR)

/** \brief 704, Channel Fractional Divider Register 24 */
#define SENT_CH24_CFDR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_CFDR*)0xF0003704u)
/** Alias (User Manual Name) for SENT_CH24_CFDR.
* To use register names with standard convension, please use SENT_CH24_CFDR.
*/
#define SENT_CFDR24 (SENT_CH24_CFDR)

/** \brief 708, Receiver Control Register 24 */
#define SENT_CH24_RCR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_RCR*)0xF0003708u)
/** Alias (User Manual Name) for SENT_CH24_RCR.
* To use register names with standard convension, please use SENT_CH24_RCR.
*/
#define SENT_RCR24 (SENT_CH24_RCR)

/** \brief 70C, Receive Status Register 24 */
#define SENT_CH24_RSR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_RSR*)0xF000370Cu)
/** Alias (User Manual Name) for SENT_CH24_RSR.
* To use register names with standard convension, please use SENT_CH24_RSR.
*/
#define SENT_RSR24 (SENT_CH24_RSR)

/** \brief 710, Serial Data and Status Register 24 */
#define SENT_CH24_SDS /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_SDS*)0xF0003710u)
/** Alias (User Manual Name) for SENT_CH24_SDS.
* To use register names with standard convension, please use SENT_CH24_SDS.
*/
#define SENT_SDS24 (SENT_CH24_SDS)

/** \brief 714, Input and Output Control Register 24 */
#define SENT_CH24_IOCR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_IOCR*)0xF0003714u)
/** Alias (User Manual Name) for SENT_CH24_IOCR.
* To use register names with standard convension, please use SENT_CH24_IOCR.
*/
#define SENT_IOCR24 (SENT_CH24_IOCR)

/** \brief 718, SPC Control Register 24 */
#define SENT_CH24_SCR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_SCR*)0xF0003718u)
/** Alias (User Manual Name) for SENT_CH24_SCR.
* To use register names with standard convension, please use SENT_CH24_SCR.
*/
#define SENT_SCR24 (SENT_CH24_SCR)

/** \brief 71C, Receive Data View Register 24 */
#define SENT_CH24_VIEW /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_VIEW*)0xF000371Cu)
/** Alias (User Manual Name) for SENT_CH24_VIEW.
* To use register names with standard convension, please use SENT_CH24_VIEW.
*/
#define SENT_VIEW24 (SENT_CH24_VIEW)

/** \brief 720, Interrupt Status Register 24 */
#define SENT_CH24_INTSTAT /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INTSTAT*)0xF0003720u)
/** Alias (User Manual Name) for SENT_CH24_INTSTAT.
* To use register names with standard convension, please use SENT_CH24_INTSTAT.
*/
#define SENT_INTSTAT24 (SENT_CH24_INTSTAT)

/** \brief 724, Interrupt Set Register 24 */
#define SENT_CH24_INTSET /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INTSET*)0xF0003724u)
/** Alias (User Manual Name) for SENT_CH24_INTSET.
* To use register names with standard convension, please use SENT_CH24_INTSET.
*/
#define SENT_INTSET24 (SENT_CH24_INTSET)

